tutorials/immersedBoundary/porousBumpChannelBodyFitted/0_org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 10;

boundaryField
{
    topAndBottom
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 10;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
